## Panda in Python

In [3]:
import pandas as pd

In [4]:
print(pd.__version__)

1.5.3

In [9]:
A = pd.Series([0.25,0.5,0.75,1.0],index = ['a','b','c','d'])

In [10]:
A

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [12]:
A.values

array([0.25, 0.5 , 0.75, 1.  ])

In [13]:
type(A.values)

numpy.ndarray

In [14]:
type(A)

pandas.core.series.Series

In [15]:
A.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [16]:
type(A.index)

pandas.core.indexes.base.Index

In [18]:
A['a']    # we can acesse values like this

0.25

In [22]:
A['a':'c']

a    0.25
b    0.50
c    0.75
dtype: float64

#### create the series object in panda using dictionaries

In [23]:
grad_dict = {'A': 4 , 'B':3.5 , 'C':3 , 'D' : 2.5 }

In [24]:
grads= pd.Series(grad_dict)

In [25]:
grads

A    4.0
B    3.5
C    3.0
D    2.5
dtype: float64

In [26]:
grads.values

array([4. , 3.5, 3. , 2.5])

In [27]:
grads.index

Index(['A', 'B', 'C', 'D'], dtype='object')

In [28]:
mark_dict = {'A': 85, 'B':75, 'C':65 ,'D':55}

In [31]:
marks = pd.Series(mark_dict)

In [32]:
marks

A    85
B    75
C    65
D    55
dtype: int64

In [33]:
marks[0:2]

A    85
B    75
dtype: int64

In [37]:
D = pd.DataFrame({'Marks':marks ,'Grades ':grads})

In [39]:
D

   Marks  Grades
A     85      4.0
B     75      3.5
C     65      3.0
D     55      2.5

In [40]:
D.T

            A     B     C     D
Marks    85.0  75.0  65.0  55.0
Grades    4.0   3.5   3.0   2.5

In [41]:
D.values

array([[85. ,  4. ],
       [75. ,  3.5],
       [65. ,  3. ],
       [55. ,  2.5]])

In [43]:
D.values[3,1]

2.5

In [45]:
D.columns

Index(['Marks', 'Grades '], dtype='object')

In [46]:
D['ScaledMarks'] = 100*(D['Marks']/90)

In [47]:
D

   Marks  Grades   ScaledMarks
A     85      4.0    94.444444
B     75      3.5    83.333333
C     65      3.0    72.222222
D     55      2.5    61.111111

In [48]:
del D['ScaledMarks']

In [49]:
D

   Marks  Grades
A     85      4.0
B     75      3.5
C     65      3.0
D     55      2.5

In [50]:
D.T

            A     B     C     D
Marks    85.0  75.0  65.0  55.0
Grades    4.0   3.5   3.0   2.5

In [56]:
G = D[D["Marks"]>60]

In [57]:
G

   Marks  Grades
A     85      4.0
B     75      3.5
C     65      3.0

In [58]:
%whos

Variable    Type         Data/Info
----------------------------------
A           Series       a    0.25\nb    0.50\nc  <...>d    1.00\ndtype: float64
D           DataFrame       Marks  Grades \nA     <...>   3.0\nD     55      2.5
G           DataFrame       Marks  Grades \nA     <...>   3.5\nC     65      3.0
M_d         Series       A    85\nB    75\nC    65\nD    55\ndtype: int64
grad_dict   dict         n=4
grads       Series       A    4.0\nB    3.5\nC    <...>nD    2.5\ndtype: float64
mark_dict   dict         n=4
marks       Series       A    85\nB    75\nC    65\nD    55\ndtype: int64
pd          module       <module 'pandas' from 'D:<...>es\\pandas\\__init__.py'>

In [59]:
del A

In [62]:
a = pd.DataFrame([{'a':1,'b':2},{'b':15,'c':5}])

In [63]:
a

     a   b    c
0  1.0   2  NaN
1  NaN  15  5.0

In [64]:
a.fillna(0)

     a   b    c
0  1.0   2  0.0
1  0.0  15  5.0

In [65]:
grads

A    4.0
B    3.5
C    3.0
D    2.5
dtype: float64

In [66]:
grads['A']

4.0

In [67]:
grads[1:3]

B    3.5
C    3.0
dtype: float64

In [71]:
grads.iloc[1:3]

B    3.5
C    3.0
dtype: float64

In [74]:
D

   Marks  Grades
A     85      4.0
B     75      3.5
C     65      3.0
D     55      2.5

In [76]:
D.iloc[2,:]

Marks      65.0
Grades      3.0
Name: C, dtype: float64